app/controllers/feedings_controller.rb

SELECT * FROM `feedings` WHERE (`feedings`.`id` IN (0,'1537-10-26 07:32:44'))
---
	  def index
	# 	@feedings = Feeding.where("starttime<=?",DateTime.now-(60*60*48))
	#	@feedings = Feeding.all

		@feedings = Feeding.find(:all,:conditions =>["starttime>=?",DateTime.now-(60*60*48)])

SELECT * FROM `feedings` WHERE (`feedings`.`id` = 1)
---
  def show
    @feeding = Feeding.find(params[:id])

SELECT * FROM `feedings` WHERE (`feedings`.`id` = 1)
---
  def edit
    @feeding = Feeding.find(params[:id])

INSERT INTO `feedings` (`endtime`, `created_at`, `babyname`, `updated_at`, `breast`, `starttime`, `email`) VALUES('2010-11-05 12:40:00', '2010-11-05 04:21:59', 'eli', '2010-11-05 04:21:59', 'left', '2010-11-05 12:21:00', 'baby@baby.com')
---
  def create
    @feeding = Feeding.new(params[:feeding])
	@feeding.babyname="Eli"
	@feeding.email="Allisonberg@yahoo.com"
    respond_to do |format|
      if @feeding.save

SELECT * FROM `feedings` WHERE (`feedings`.`id` = 1)
UPDATE `feedings` SET `updated_at` = '2010-11-26 22:45:10', `babyname` = 'Eli', `endtime` = '2010-11-26 22:45:00', `starttime` = '2010-11-26 22:30:00', `email` = '' WHERE `id` = 13
---
  def update
    @feeding = Feeding.find(params[:id])
	Time.zone="Eastern Time (US & Canada)"

    respond_to do |format|
      if @feeding.update_attributes(params[:feeding])

SELECT * FROM `feedings` WHERE (`feedings`.`id` = 1)
DELETE FROM `feedings` WHERE `id` = 1
---
  def destroy
    @feeding = Feeding.find(params[:id])
    @feeding.destroy