app/controllers/naps_controller.rb

  def index
    @naps = Nap.all
---
SELECT * FROM `naps`

  def show
    @nap = Nap.find(params[:id])
---
SELECT * FROM `naps` WHERE (`naps`.`id` = 1)

  def create
    @nap = Nap.new(params[:nap])
	@nap.babyname="Eli"
	@nap.email="allisonberg@yahoo.com"
    respond_to do |format|
      if @nap.save
---
INSERT INTO `naps` (`endtime`, `created_at`, `babyname`, `updated_at`, `starttime`, `email`) VALUES('2011-02-06 13:27:00', '2011-02-06 13:27:53', 'Eli', '2011-02-06 13:27:53', '2011-02-06 13:27:00', 'allisonberg@yahoo.com')